package com.javarush.task.task24.task2413;

/**
 Арканоид(2)
 Главному классу (Arkanoid) нужно будет хранить информацию о размерах поля, где будут происходить все действия.

 Поэтому:
 а) добавь в класс Arkanoid два приватных поля width(ширина) и height(высота) типа int
 б) создай для них публичные геттеры и сеттеры


 Требования:
 1. В классе Arkanoid должно быть создано приватное поле width типа int.
 2. В классе Arkanoid должно быть создано приватное поле height типа int.
 3. В классе Arkanoid должен быть создан корректный геттер для поля height.
 4. В классе Arkanoid должен быть создан корректный геттер для поля width.
 5. В классе Arkanoid должен быть создан корректный сеттер для поля height.
 6. В классе Arkanoid должен быть создан корректный сеттер для поля width.
 */

public class Arkanoid {
    public static void main(String[] args) {
        
    }
}
